---
title: PanelTypeSet
classe: Autodesk.Revit.DB.PanelTypeSet
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# PanelTypeSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsEmpty { get; }` | `panelTypeSet.IsEmpty` | Boolean |
| `Int32 Size { get; }` | `panelTypeSet.Size` | Int32 |
| `Void Clear()` | `panelTypeSet.Clear()` | Void |
| `Boolean Contains(PanelType)` | `panelTypeSet.Contains(item)` | Boolean |
| `Int32 Erase(PanelType)` | `panelTypeSet.Erase(item)` | Int32 |
| `PanelTypeSetIterator ForwardIterator()` | `panelTypeSet.ForwardIterator()` | PanelTypeSetIterator |
| `IEnumerator GetEnumerator()` | `panelTypeSet.GetEnumerator()` | IEnumerator |
| `Boolean Insert(PanelType)` | `panelTypeSet.Insert(item)` | Boolean |
| `PanelTypeSetIterator ReverseIterator()` | `panelTypeSet.ReverseIterator()` | PanelTypeSetIterator |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```